"AU Direct Debit" = "Debitu Dirett AU";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "Alipay";

"BLIK" = "BLIK";

"Bacs Direct Debit" = "Debitu Dirett BACS";

"Bancontact" = "Bancontact";

"Boleto" = "Boleto";

"Card" = "Karta";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Konbini" = "Konbini";

"Link" = "Link";

"NetBanking" = "NetBanking";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "Debitu SEPA";

"Sofort" = "Sofort";

"Swish" = "Swish";

"Timed out authenticating your payment method -- try again" = "Skada l-ħin tal-awtentikazzjoni tal-metodu tal-ħlas tiegħek -- erġa' pprova";

"UPI" = "UPI";

"US bank account" = "Kont tal-bank fl-Istati Uniti tal-Amerka";

"Unknown" = "Mhux magħruf";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Ma nistgħux nawtentikaw il-metodu tal-ħlas tiegħek. Jekk jogħġbok agħżel metodu tal-ħlas differenti u erġa' pprova.";

"WeChat Pay" = "WeChat Pay";

"giropay" = "Giropay";

"iDEAL" = "iDEAL";
